In [1]:
import numpy as np
import pandas as pd

s1 = pd.Series([0,1], index=['a','b'])
display(s1)
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])
display(s2)
s3 = pd.Series([5, 6], index=['f', 'g'])
display(s3)

a    0
b    1
dtype: int64

c    2
d    3
e    4
dtype: int64

f    5
g    6
dtype: int64

In [2]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [3]:
pd.concat([s1, s2, s3],axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [4]:
pd.concat([s1, s2, s3], keys=['one', 'two', 'three'])

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [5]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])
display(df1)
display(df2)

          a         b         c         d
0  1.064402 -0.531665 -0.833274 -0.803544
1 -0.012009  0.864993 -0.542852  0.680229
2 -0.058541 -0.176959  3.009154 -0.219888

          b         d         a
0 -0.901682 -0.070704  1.362452
1  0.732120 -0.020580  0.155222

In [6]:
pd.concat([df1,df2],keys=['10_1','10_2'])

               a         b         c         d
10_1 0  1.064402 -0.531665 -0.833274 -0.803544
     1 -0.012009  0.864993 -0.542852  0.680229
     2 -0.058541 -0.176959  3.009154 -0.219888
10_2 0  1.362452 -0.901682       NaN -0.070704
     1  0.155222  0.732120       NaN -0.020580

In [7]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0  1.064402 -0.531665 -0.833274 -0.803544
1 -0.012009  0.864993 -0.542852  0.680229
2 -0.058541 -0.176959  3.009154 -0.219888
3  1.362452 -0.901682       NaN -0.070704
4  0.155222  0.732120       NaN -0.020580

In [8]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2),
                   index=['a', 'b', 'c'],
                   columns=['one','two'])
display(df1)
df2 = pd.DataFrame(np.arange(4).reshape(2, 2),
                   index=['a', 'c'],
                   columns=['three','four'])
display(df2)

   one  two
a    0    1
b    2    3
c    4    5

   three  four
a      0     1
c      2     3

In [9]:
pd.concat([df1, df2],axis=1,keys=['level1','level2'])

  level1     level2
     one two  three four
a      0   1    0.0  1.0
b      2   3    NaN  NaN
c      4   5    2.0  3.0